cluster/time_table.org
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK")
#+OPTIONS: date:t e:t email:nil f:t inline:t num:t p:nil pri:nil
#+OPTIONS: prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t
#+OPTIONS: toc:nil todo:t |:t#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK")
#+OPTIONS: date:t e:t email:nil f:t inline:t num:t p:nil pri:nil
#+OPTIONS: prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t
#+OPTIONS: toc:nil todo:t |:t

#+OPTIONS: H:2
#+EMAIL: stanislav.arn@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.2.1)

#+TITLE: Towards Bringing Together Numerical Methods for Partial Differential Equation and Deep Neural Networks
#+DATE: <{{{time(%d-%m-%Y)}}}>
#+AUTHOR: Stanislav Arnaudov

#+LATEX_COMPILER: pdflatex
#+LaTeX_CLASS: llncs
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage{cite}
#+LATEX_HEADER: \usepackage{parskip}
# #+LATEX_HEADER: \usepackage[margin=1.4in, tmargin=0.1in]{geometry}
#+LATEX_HEADER: \usepackage{pgfgantt}
#+LATEX_HEADER: \usepackage{svg}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \institute{Karlsruhe Institute of Technology,\\Kaiserstrasse 12,76131 Karlsruhe, Germany\\ \url{http://www.kit.edu/english/}}
#+LATEX_HEADER_EXTRA: \selectlanguage{english}


* Timing experiments

In order to justify the requested resources, we've performed some preliminary experiments to see how much time our models need for training. Without getting into too much detail, we have three types of models that are to be evaluated -- constant (C), inflow speed (S) and viscosity-density (VD). Each model type has an estimated training time (ETT) and a certain number of tries because we also want to try different hyper-parameters. All of the models have to be trained on GPU nodes. This means that for one hour of training time, we need 48 hours of CPU time.

\\

The total time for a model type is calculated as SUM=TRIES x ETT x 48. We've also added 20% overestimate to the expected total time, just to be sure that we can train our models. The following table summarizes our estimations:

| Model type |   |   | ETT  |   |   | Tries |   |   | Sum               |
|------------+---+---+------+---+---+-------+---+---+-------------------|
| /          | < |   |      |   |   |       | < |   |                   |
| C          |   |   | 5 h  |   |   |    10 |   |   | 2 400 cpu-h       |
| S          |   |   | 70h  |   |   |    10 |   |   | 33 600 cpu-h      |
| VD         |   |   | 350h |   |   |    10 |   |   | 168 000 cpu-h     |
|------------+---+---+------+---+---+-------+---+---+-------------------|
| Total:     |   |   |      |   |   |       |   |   | 204 000 cpu-h     |
| + 20%      |   |   |      |   |   |       |   |   | $\approx$ 250 000 cpu-h |
|------------+---+---+------+---+---+-------+---+---+-------------------|



